tests/load.test.yaml
config:
  target: "http://localhost:8010"
  phases:
    - duration: 10
      arrivalRate: 20
      name: "Warming up"
  processor: "./load.test.processor.js"
  timeout: 3
  ensure:
    p99: 50
  defaults:
    headers:
      content-type: "application/json"
  environments:
    test:
      target: "http://localhost:8010"
      phases:
        - duration: 5
          arrivalRate: 0
          rampTo: 1
          name: "Warm up the application"
        - duration: 10
          arrivalCount: 1
          name: "Sustained max load 1 every 30 seconds"
scenarios:
  - name: "Get check-health status, insert rides then display rides"
    flow:
    - function: generateRide
    - get:
        url: "/health"
    - log: "Check-health completed"
    - post:
        url: "/rides"
        json:
          start_lat: "{{ start_lat }}"
          end_lat: "{{ end_lat }}"
          start_long: "{{ start_long }}"
          end_long: "{{ end_long }}"
          rider_name: "{{ rider_name }}"
          driver_name: "{{ driver_name }}"
          driver_vehicle: "{{ driver_vehicle }}"
    - log: "Post request to /rides - riderName {{ rider_name }}"
    - think: 5
    - get:
        url: "/rides"
        expect:
          - statusCode: 200
    - log: "Get request to /rides"